In [117]:
import pandas as pd

In [191]:
data = pd.read_csv('C:\\Users\\ITEL\\Documents\\XL\\data_random.csv', sep=';')

In [192]:
data_original = data.copy()

In [193]:
print(data.columns)

Index(['Nama', 'Umur', 'Kota'], dtype='object')

In [194]:
# mengganti nama kolom

data.rename(columns={'Nama': 'Nama Lengkap'}, inplace=True)

In [195]:
data

          Nama Lengkap  Umur               Kota
0      Christopher Lam  48.0        Port Kelsey
1                  NaN  48.0    Veronicachester
2    Joseph Valdez Jr.  28.0      Amandaborough
3         Pamela Davis  32.0       Port Jessica
4    Kenneth Rodriguez  20.0                NaN
..                 ...   ...                ...
145         Paul Boyer  45.0  South Barbaraberg
146                NaN  31.0  Lake Michaelshire
147   Elizabeth Suarez  38.0           Lake Jay
148        Lisa Wilson  31.0          Caseyport
149      Kimberly Vega   NaN   Lake Natashastad

[150 rows x 3 columns]

In [196]:
# menghapus kolom

data.drop(columns=['Kota'], inplace=True)

In [197]:
print(data)

          Nama Lengkap  Umur
0      Christopher Lam  48.0
1                  NaN  48.0
2    Joseph Valdez Jr.  28.0
3         Pamela Davis  32.0
4    Kenneth Rodriguez  20.0
..                 ...   ...
145         Paul Boyer  45.0
146                NaN  31.0
147   Elizabeth Suarez  38.0
148        Lisa Wilson  31.0
149      Kimberly Vega   NaN

[150 rows x 2 columns]

In [202]:
# Menghapus baris yang memiliki nilai hilang
data.dropna(inplace=True)

In [203]:
data

                  Nama  Umur               Kota
0      Christopher Lam  48.0        Port Kelsey
2    Joseph Valdez Jr.  28.0      Amandaborough
3         Pamela Davis  32.0       Port Jessica
5       Raymond Miller  29.0        Justinville
6         Steven White  39.0           New Toni
..                 ...   ...                ...
143    Meredith Mendez  53.0         Adrianstad
144       Jill Hoffman  35.0    West Tommymouth
145         Paul Boyer  45.0  South Barbaraberg
147   Elizabeth Suarez  38.0           Lake Jay
148        Lisa Wilson  31.0          Caseyport

[125 rows x 3 columns]

In [208]:
# mengisi nilai hilang dengan nilai tertentu

data= data_original.copy()
data.fillna(value={'Umur': '0'}, inplace=True)

In [209]:
data

                  Nama  Umur               Kota
0      Christopher Lam  48.0        Port Kelsey
1                  NaN  48.0    Veronicachester
2    Joseph Valdez Jr.  28.0      Amandaborough
3         Pamela Davis  32.0       Port Jessica
4    Kenneth Rodriguez  20.0                NaN
..                 ...   ...                ...
145         Paul Boyer  45.0  South Barbaraberg
146                NaN  31.0  Lake Michaelshire
147   Elizabeth Suarez  38.0           Lake Jay
148        Lisa Wilson  31.0          Caseyport
149      Kimberly Vega     0   Lake Natashastad

[150 rows x 3 columns]

In [210]:
# Mengubah tipe data kolom
data['Umur'] = data['Umur'].astype('float')

In [211]:
data.dtypes

Nama     object
Umur    float64
Kota     object
dtype: object

In [214]:
# Membuat kolom baru berdasarkan kolom yang ada
data['Dewasa'] = data['Umur'] >= 30.0

In [215]:
print(data)

                  Nama  Umur               Kota  Dewasa
0      Christopher Lam  48.0        Port Kelsey    True
1                  NaN  48.0    Veronicachester    True
2    Joseph Valdez Jr.  28.0      Amandaborough   False
3         Pamela Davis  32.0       Port Jessica    True
4    Kenneth Rodriguez  20.0                NaN   False
..                 ...   ...                ...     ...
145         Paul Boyer  45.0  South Barbaraberg    True
146                NaN  31.0  Lake Michaelshire    True
147   Elizabeth Suarez  38.0           Lake Jay    True
148        Lisa Wilson  31.0          Caseyport    True
149      Kimberly Vega   0.0   Lake Natashastad   False

[150 rows x 4 columns]